#<- Active Taps ->
tap "buo/cask-upgrade"            # Best for manually updating GUI apps (casks) with more control

# <- Essential Binaries ->
brew "git"                        # Distributed revision control system
brew "mas"                        # Command-line interface for the Mac App Store
brew "curl"                       # Gets a file from an HTTP, HTTPS or FTP server
brew "stow"                       # Symlink farm manager that organizes dotfiles under a single directory

# <- Programming Relevant ->
brew "fnm"                        # Fast and simple Node.js version manager
brew "mysql"                      # Open source relational database management system
brew "colima"                     # Container runtimes on MacOS (and Linux) with minimal setup
brew "docker"                     # Pack, ship and run any application as a lightweight container
cask "temurin@21"                 # Java Development Kit from the Eclipse Foundation (Adoptium)
cask "dbeaver-community"          # Universal database tool and SQL client


# <- Active "Everyday" Binaries ->
brew "television"                 # fast, portable fuzzy finder for the terminal (similar to telescope)
brew "git-delta"                  # syntax-highlighting pager for git and diff output
brew "starship"                   # cross-shell prompt for astronauts
brew "diffnav"                    # git diff pager based on delta but with a file tree
brew "ripgrep"                    # search tool like grep and the silver searcher
brew "scooter"                    # interactive find-and-replace terminal UI app
brew "neovim"                     # ambitious vim-fork focused on extensibility and agility
brew "zoxide"                     # shell extension to navigate your filesystem faster
brew "trash"                      # command-line tool that moves files or folder to the trash
brew "atuin"                      # improved shell history for zsh, bash, fish and nushell
brew "tmux"                       # terminal multiplexer
brew "bat"                        # syntax highlighting with git integration
brew "eza"                        # modern replacement for ls
brew "fzf"                        # command-line fuzzy finder written in go 
brew "fd"                         # simple, fast and user-friendly alternative to find

# <- Active "Occasional" Binaries ->
brew "jordond/tap/jolt"           # terminal-based battery and energy monitor for macOS and Linux
brew "rmlint"                     # fast tool to remove dupes and other lint from your filesystem
brew "tokei"                      # fast and accurate code counter
brew "btop"                       # resource monitor c++ version (Choose 1: btop/neohtop)
brew "ncdu"                       # (Local) detailed disk usage analysis and cleanup
brew "glow"                       # terminal based markdown reader

# <- Active "Fun" Binaries ->
brew "macchina"                   # system information fetcher, with an emphasis on performance & minimalism
brew "pipes-sh"                   # animated pipes terminal screensaver
brew "cmatrix"                    # terminal screensaver based of "the matrix" like implementation
brew "bagels"                     # powerful expense tracker that lives in your terminal
brew "cava"                       # console-based Audio Visualizer for ALSA

# <- Inactive Binaries ->
# brew "uv"                         # extremely fast Python package installer and resolver
# brew "yazi"                       # blazing fast terminal file manager written in Rust
# brew "helix"                      # post-modern modal text editor
# brew "hoard"                      # command organizer tool to hoard all your precious commands
# brew "gitui"                      # blazing fast terminal-ui for git written in rust
# brew "vivid"                      # generator for ls_colors; supports multiple color themes
# brew "zellij"                     # pluggable terminal workspace, with terminal multiplexer as the base feature
# brew "hyperfine"                   # command-line benchmarking tool


# <- Active Apps ->
cask "nikitabobko/tap/aerospace"  # i3-like tiling window manager for macos
cask "stefanlogue/tools/meteor"   # simple customisable CLI tool that helps you to write conventional git commits
cask "visual-studio-code"         # open-source code editor
cask "reminders-menubar"          # simple menu bar app to view and interact with reminders
cask "miniforge"                  # minimal installer for conda specific to conda-forge
cask "librewolf"                  # privacy-focused version of the firefox browser
cask "obsidian"                   # private and flexible writing app stored locally
cask "ghostty"                    # terminal emulator that uses platform-native ui and gpu acceleration
cask "alfred"                     # application launcher and productivity software
cask "github"                     # desktop client for github repositories
cask "maccy"                      # clipboard manager for macos
cask "trex"                       # easy to use text extraction tool
cask "zed"                        # multiplayer code editor
cask "zen"                        # firefox alternative browser

# <- Inactive Apps ->
# cask "xbar"                       # view outputs from scripts in the menu bar
# cask "neat"                       # github notifications on your desktop and menu bar
# cask "itsycal"                    # tiny menu bar calendar
# cask "rectangle"                  # move and resize windows using keyboard shortcuts or snap areas
# cask "appcleaner"                 # small application to thoroughly uninstall unwanted apps
# cask "jordanbaird-ice"            # hide menu bar items to give your mac a cleaner look


# <- Active Fonts ->
# cask "font-fira-code"
# cask "font-iosevka-aile"
# cask "font-cascadia-code"
cask "font-maple-mono-nf"
cask "font-jetbrains-mono-nerd-font"


# <- Active Mac Apps ->
mas "BarNotes", id: 6744329261, purchase: true
mas "Amphetamine", id: 937984704, purchase: true
mas "Hand Mirror", id: 1502839586, purchase: true
mas "Microsoft Word", id: 462054704, purchase: true
mas "Microsoft Excel", id: 462058435, purchase: true


# <- Inactive Mac Apps ->
# mas "HP Smart", id: 1474276998, purchase: true   # hp smart app that lets you print, scan, fax, and share documents
# mas "JotItDown", id: 1668513911, purchase: true  # (update STILL breaks things, due to shortcuts)
